### if there are only 6 unique continents, but there are 1000000 rows, even this takes same space we can store continents in a list, can pass index, so that it occupes less space this is available readymade in pandas, called CATEGORY. but if we are going to store country as category, it is going to store same no of strings and small integers. so size increases substantially bur speeds up computations

In [1]:
import pandas as pd

In [2]:
col_names=['sl_no','age','gender','role','id']
data=pd.read_table("/home/ila/PycharmProjects/pythonworks/artificialintelligence/pandas/files/ex.txt",sep="|",names=col_names)#not sure ahy header=0 is used

/home/ila/anaconda3/envs/featurebranch/lib/python3.6/site-packages/ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead.

In [3]:
data.columns

Index(['sl_no', 'age', 'gender', 'role', 'id'], dtype='object')

In [4]:
data.info

<bound method DataFrame.info of      sl_no  age gender           role     id
0        1   24      M     technician  85711
1        2   53      F          other  94043
2        3   23      M         writer  32067
3        4   24      M     technician  43537
4        5   33      F          other  15213
5        6   42      M      executive  98101
6        7   57      M  administrator  91344
7        8   36      M  administrator  05201
8        9   29      M        student  01002
9       10   53      M         lawyer  90703
10      11   39      F          other  30329
11      12   28      F          other  06405
12      13   47      M       educator  29206
13      14   45      M      scientist  55106
14      15   49      F       educator  97301
15      16   21      M  entertainment  10309
16      17   30      M     programmer  06355
17      18   35      F          other  37212
18      19   40      M      librarian  02138
19      20   42      F      homemaker  95660
20      21   26      M         writer  30068
21      22   25      M         writer  40206
22      23   30      F         artist  48197
23      24   21      F         artist  94533
24      25   39      M       engineer  55107
25      26   49      M       engineer  21044
26      27   40      F      librarian  30030
27      28   32      M         writer  55369
28      29   41      M     programmer  94043
29      30    7      M        student  55436
..     ...  ...    ...            ...    ...
913    914   44      F          other  08105
914    915   50      M  entertainment  60614
915    916   27      M       engineer  N2L5N
916    917   22      F        student  20006
917    918   40      M      scientist  70116
918    919   25      M          other  14216
919    920   30      F         artist  90008
920    921   20      F        student  98801
921    922   29      F  administrator  21114
922    923   21      M        student  E2E3R
923    924   29      M          other  11753
924    925   18      F       salesman  49036
925    926   49      M  entertainment  01701
926    927   23      M     programmer  55428
927    928   21      M        student  55408
928    929   44      M      scientist  53711
929    930   28      F      scientist  07310
930    931   60      M       educator  33556
931    932   58      M       educator  06437
932    933   28      M        student  48105
933    934   61      M       engineer  22902
934    935   42      M         doctor  66221
935    936   24      M          other  32789
936    937   48      M       educator  98072
937    938   38      F     technician  55038
938    939   26      F        student  33319
939    940   32      M  administrator  02215
940    941   20      M        student  97229
941    942   48      F      librarian  78209
942    943   22      M        student  77841

[943 rows x 5 columns]>

### at the end shows in + in memory. object type stores string, and not counted

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
sl_no     943 non-null int64
age       943 non-null int64
gender    943 non-null object
role      943 non-null object
id        943 non-null object
dtypes: int64(2), object(3)
memory usage: 36.9+ KB

#### now original size is displayed

In [6]:
data.memory_usage(deep=True)

Index        80
sl_no      7544
age        7544
gender    62238
role      61400
id        58466
dtype: int64

In [7]:
data.memory_usage(deep=True).sum()

197272

In [8]:
data.head()

   sl_no  age gender        role     id
0      1   24      M  technician  85711
1      2   53      F       other  94043
2      3   23      M      writer  32067
3      4   24      M  technician  43537
4      5   33      F       other  15213

#### size of roles is reduxed from 61400 to 2952

In [9]:
data['role']=data.role.astype('category')
data.dtypes

sl_no        int64
age          int64
gender      object
role      category
id          object
dtype: object

In [10]:
data.memory_usage(deep=True)

Index        80
sl_no      7544
age        7544
gender    62238
role       2952
id        58466
dtype: int64

#### if we wanna c the index

In [11]:
data.role.cat.codes

0      19
1      13
2      20
3      19
4      13
5       6
6       0
7       0
8      18
9       9
10     13
11     13
12      3
13     17
14      3
15      5
16     14
17     13
18     10
19      8
20     20
21     20
22      1
23      1
24      4
25      4
26     10
27     20
28     14
29     18
       ..
913    13
914     5
915     4
916    18
917    17
918    13
919     1
920    18
921     0
922    18
923    13
924    16
925     5
926    14
927    18
928    17
929    17
930     3
931     3
932    18
933     4
934     2
935    13
936     3
937    19
938    18
939     0
940    18
941    10
942    18
Length: 943, dtype: int8

In [12]:
data.role.cat.categories

Index(['administrator', 'artist', 'doctor', 'educator', 'engineer',
       'entertainment', 'executive', 'healthcare', 'homemaker', 'lawyer',
       'librarian', 'marketing', 'none', 'other', 'programmer', 'retired',
       'salesman', 'scientist', 'student', 'technician', 'writer'],
      dtype='object')

In [14]:
cache=pd.DataFrame({'ID':[100,101,102,103], 'quality': ['good','very good','good','excellent']})
cache

    ID    quality
0  100       good
1  101  very good
2  102       good
3  103  excellent

In [15]:
type(cache)

pandas.core.frame.DataFrame

In [17]:
type(cache.ID)

pandas.core.series.Series

In [18]:
cache.sort_values('quality')

    ID    quality
3  103  excellent
0  100       good
2  102       good
1  101  very good